{
    "name": "nextjs-chakra-ui",
    "plugins": [
        {
            "name": "Chakra UI",
            "description": "Chakra UI is a simple, modular and accessible component library that gives you the building blocks you need to build your React applications.",
            "url": "https://chakra-ui.com/docs/getting-started"
        },
        {
            "name": "CSS / styled-jsx",
            "description": "Next.js comes with built-in support for CSS and styled-jsx. Styled-jsx is full, scoped and component-friendly CSS support for JSX (rendered on the server or the client).",
            "url": "https://github.com/vercel/styled-jsx"
        },
        {
            "name": "Fetch",
            "description": "Next.js has a built-in polyfill for the fetch API. You don't need to worry about using it on either server or client side.",
            "url": "https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API"
        },
        {
            "name": "Storybook",
            "description": "Storybook is an open source tool for developing UI components in isolation for React, Vue, Angular, and more. It makes building stunning UIs organized and efficient.",
            "url": "https://storybook.js.org/docs/react/get-started/introduction"
        },
        {
            "name": "SVGR",
            "description": "Transform SVGs into React components.",
            "url": "https://react-svgr.com/docs/getting-started/"
        },
        {
            "name": "Bundle Analyzer",
            "description": "Use webpack-bundle-analyzer in your Next.js project. Visualize size of webpack output files with an interactive zoomable treemap.",
            "url": "https://github.com/vercel/next.js/tree/canary/packages/next-bundle-analyzer"
        },
        {
            "name": "ESLint",
            "description": "A pluggable and configurable linter tool for identifying and reporting on patterns in JavaScript. Maintain your code quality with ease.",
            "url": "https://eslint.org/docs/user-guide/getting-started"
        },
        {
            "name": "Prettier",
            "description": "An opinionated code formatter; Supports many languages; Integrates with most editors.",
            "url": "https://prettier.io/docs/en/index.html"
        },
        {
            "name": "lint-staged",
            "description": " The concept of lint-staged is to run configured linter (or other) tasks on files that are staged in git.",
            "url": "https://github.com/okonet/lint-staged"
        },
        {
            "name": "Docker",
            "description": "Docker simplifies and accelerates your workflow, while giving developers the freedom to innovate with their choice of tools, application stacks, and deployment environments for each project.",
            "url": "https://www.docker.com/get-started"
        }
    ]
}
